[
  {
    "id": "6f0709ce-cc61-4d7f-82b1-f50c3b5e48d7",
    "title": "After almost 7 years, I finally found a goal in crypto.",
    "slug": "afteralmost7yearsifinallyfoundagoalincrypto--6f0709",
    "author_name": "katexbt.hl",
    "image": "https://pbs.twimg.com/media/Gt_jrdpXUAAit25.jpg",
    "author_handle": "katexbt",
    "author_avatar": "https://pbs.twimg.com/profile_images/1965699098688073728/qNcfLt8a_normal.jpg",
    "article_published_at": "2025-06-21T20:53:41+00:00",
    "article_url": "https://x.com/katexbt/status/1936527967624057223",
    "updated_at": "2025-10-19T20:40:34.153+00:00",
    "category": "",
    "tweet_id": "1936527967624057223",
    "tweet_text": "https://t.co/CcTk96ekJC",
    "tweet_published_at": "2025-06-21T20:53:41+00:00",
    "tweet_views": 138762,
    "tweet_replies": 124,
    "tweet_retweets": 56,
    "tweet_likes": 803,
    "tweet_bookmarks": 636,
    "article_preview_text": "3 months ago, I almost lost everything I had in crypto.\nAt the stone cold local bottom lows, no less.\n\nI was very close to giving it all up.\n\nThis is my story of how I was, somehow, able to turn it",
    "full_article_content": "3 months ago, I almost lost everything I had in crypto.\n\nAt the stone cold local bottom lows, no less.\n\nI was very close to giving it all up.\n\nThis is my story of how I was, somehow, able to turn it around.\n\nThe reason why I decided to share this, especially now, is because I believe there is a lesson that you can take away from this.\n\n3 months ago, I was in Japan briefly on work related duties, since I also have a web2 job, it is not uncommon for me to travel and meet all sorts of people.\n\nOnce work was done in Osaka, my coworkers and I headed back to Tokyo, with them going to the hotel to rest after a long journey, and me to a nearby McDonalds, being the pig that I am, to get something to eat.\n\nWhenever I order, I use the McDonalds app - apple pay convenience, no touching dirty screens after everyone's had their way with them, and ofc discounts.\n\nI order a happy meal; cheeseburger and coffee, random toy to bring tomorrow to my 6 year old niece, ¥470.\n\nI sit, eat, and try to enjoy the coffee while scrolling X.\n\nOn X, peak despair - BTC at 82k, Trump's Tariffs, FED won't cut, Ansem is bearish, GCR isn't posting, Cobie's not helping us, SOL 120, people agreeing that Kaito literally ruined CT and Hype is at single digits.\n\nPeople I used to DM somewhat often aren't responding or aren't messaging me.\n\nGroupchats? Dead.\n\nI turn over to my Telegram, to check if anything interesting has been mentioned, or if anyone dm'd me; nothing, just people calling for 68k previous ATH support retests.\n\nAs it usually goes, 15 minutes of scrolling quickly turn to an hour, and it slowly but surely gets to me - what if I screwed up the only opportunity I had to sell and liquidate garbage at decent prices?\n\nThe thing with money is - there's a lot of people on here that ended up hitting 7-8 figures, and are still as miserable.\n\nLots of people who hit 6-7, roundtripped, hit it again, maybe even higher, and then still - miserable and upset..the thought permeates my mind, and I start wondering if its even worth bothering.\n\nAs these thoughts keep plaguing my head, I hear someone next to me calling me.\n\nAn elderly woman, I'd say at least early to mid 60s, in a McDonalds employee uniform and face mask, starts trying to have a conversation with me.\n\n\"Is your coffee OK?\", or something to that effect, with the biggest smile you could ever infer from behind a face mask.\n\nIt takes me a minute to parse what it is she's trying to talk to me about, and then I realize; ah, okay, she's doing one of those customer satisfaction survey things, since I've been staying here for over an hour.\n\nShe hands me a QR code to scan, it opens the McDonalds app, and there's a torrential gust of questions that the app starts asking me:\n\n\"Were you greeted loudly and with a smile when you entered?\"\n\n\"Are you happy with the level of cleanliness in this establishment\"\n\n\"Were there any problems with the ordering process?\"\n\n\"Were the employees nice towards you and helped you if you needed help?\"...\n\nI've worked retail before, for a tiny bit at least, so I know how it goes - I give her all 5 stars and in the feedback field I type out a huge slew of compliments as if I were a regular and not someone who is most likely on their first and last ever visit to this McDonalds in the outskirts of Tokyo.\n\nThe reaction surprises me - as I am typing out an essay in a small feedback comment field, she keeps smiling and more and more audibly thanking me, and in return smiling even more.\n\nOnce I finish the last question, she hands me over a coupon code that entitles me to a free drink in the next 7 days on the app, but with how happy she is, she brings me over another coffee and starts talking to me even more about how happy she is to see this review.\n\nMy first notion is to feel a bit sad for them - a woman easily my mother's age, not in retirement but in fact working what many westerners would consider a demeaning and entry-level highschool level job, and, what's even more puzzling - seemingly very happy.\n\nI can see that she's keen to talk in english and improve it with me with me; we start chatting about the usual things: am I a tourist, do I visit McDonalds often to eat, how do I like Tokyo.\n\nI answer that I've been here many times, that I indeed do order often, and I ask her how long she's been working here.\n\nShe said to me that she's been working here for the past 3 years, that she's 67 years old, and that since her husband passed away during COVID she decided she needed something to do and that working here is close to where she lives and that she tries to make everyone feel at home - given her limited english, this took well over a few minutes, but I understood it.\n\nI asked her is it common for older people to work like this, is it for money - to which she replied that for some it is, but for most its for just having something to do and to keep busy and active.\n\nShe asked me if I had any children (I guess the Happy Meal toy gave it away), to which I replied no, to which she was a bit perplexed but then quickly smiled and said \"me neither\".\n\nAs she carried on with a smile and tapped me on the shoulder, she took a pen out from the standard issued McDonalds uniform shirt pocket.\n\nAnd then it hit me, just as she was waving goodbye and handing me the note (pictured below), I started feeling a bit uneasy.\n\nI instantly fell into a shock - although my first reaction was \"gosh..that's sad..67 and still working this..I sure hope that's not me\", I realized quickly - it's a matter of choice for most, and a lot of things in life we are handed, we have a variety of choices in how to react to.\n\nJust 20 minutes prior to being handed the note, I was thinking of selling it all - and taking an extremely long hiatus.\n\nTWAP out of my ETH, SOL, HYPE, garbage altcoin stacks on the first 15-25% days out, and not think about it, and just focus on building and doing something else and not have to login and bother with any of this here. I didn't care about the prices, I just wanted to be out of this and done with it and not come back.\n\nSo, why did I say that I \"almost lost everything I had in crypto?\" - it's very simple, I lost my willingness to bother with this space and I had my mind dead set on leaving right then and there, that very day.\n\nBut having that chat with Shimode, the worker from the McDonalds, and seeing how genuinely happy it made her to be highly rated for barely a $3 happy meal and service that surrounded it, made me reconsider, and most importantly - it made me set a plan up, because for the 6 years prior to that day, I've had no goals in crypto other than \"being there for the ride\".\n\nI finally have a goal.\n\nI don't think of myself as a net positive in the crypto space (despite my Ethos ranking saying 1800, reputable, whatever), I'm as human as the rest of you.\n\nI don't think of myself as a net negative either, I think there's a lot better candidates than me for getting wiped off the face of the timeline and never to come back.\n\nI just am, like most people on here.\n\nIf you've read all of this so far - thank you, and let me get to my final point.\n\nAfter that humbling interaction I went to the hotel room, took out a notepad, and started writing the things I want to do in life.\n\nI drafted a rough cost estimate of what the runway and timeline is for these things, alongside pessimistic/optimistic measures and how much I am setting aside for the people that matter most to me in life, if something were to happen to me (or, better yet, as I hope will be the case, if nothing were to happen to me, but I'd like to take them on these experiences in life with me).\n\nI'm in my mid 30s, and there's a lot that I have been through, but also a lot that I haven't let myself experience because I sacrificed it one way or the other.\n\nI'm not an agreeable person - and while I try my best never radiate that on here, in real life, as some friends, former and current, would attest -  it's very much palpable.\n\nI'm not a top performer, I don't do this crypto thing full time, there are no @thiccyth0t silk pyjamas for me, not now and most likely not ever; despite my years here I'm a casual player in what is a very cutthroat cycle(?) with unprecedented levels of crime.\n\nBut that doesn't mean that the crypto dream of ever so slightly higher levels of financial freedom for the average Joe and Joan are dead.\n\nThe \"in my garage hollywood hills Lamborghini\" dreams never interested me, and even if they did, the odds are, this cycle compared to the one 9 years ago are not the place to search for it, with how returns are compressed this time around.\n\nFor the first time ever, I actually put my goals on paper\n\nAnd I implore you to do the same - otherwise you WILL be stuck here and you WILL have NOTHING to show for it.\n\nThis (probably) shouldn't apply to you if you're a top performer and more experienced than me - I have nothing to really teach you, let alone tell you how you should live your life.\n\nBut if you're someone who does not classify themselves as a top performer, yet is a somewhat active participant, especially in the social part of crypto - having a REALISTIC list of things you actually NEED the money for will help you not puke and roundtrip whatever it is you end up making, and will help you TP more aggressively, even if we do end up going to altszn valhalla at some point.\n\nAfter 7 years, I finally have a number and plan that I can commit to and that I can execute on within a 2 year timeframe.\n\nAnd it's much, much lower than anyone on this website will tell you.\nMUCH, MUCH LOWER.\n\nI won't go into detail because it's too personal, but the list of goals I drafted up (and really only ever made minimal additions/changes to since 3 months ago) is very simple and few of them are actually material:\n\nThere are no luxury/branded items on the list. Zero.\n\nThere are more people mentioned by name/relationship to, than inanimate objects.\n\nThere are many more deadman switches, contingencies and logistics related things than I first thought would be.\n\nDespite that, the list (while not FIRE in nature) assumes a somewhat meager, self-sufficient and peaceful life, with clearly labeled and (at least barring any calamities a la COVID19) realistic timeframes.\n\nAnd most importantly - it's a lifestyle that perfectly suits me and I think the people in my life too.\n\nWhy are you in crypto, really?\n\nIf you came this far, I thank you and congratulate you, and I have one more request of you - to turn off your computer/phone if you feel that this article resonated in any way with you, and to draft your own list of things that matter the most to you in life and what the associated (approximate) costs are, and how long will it take you to get to that number.\n\nThese are not retirement numbers - these are \"the things that matter most to me in my life right now and the foreseeable future\" numbers.\n\nI am now maybe 50-55% away from these goals.\n\nAnd this is with quite a bit of leeway and me cashing out regularly in the past 6-12 months - I think it's doable in the next few years, and that's how much I'm willing to give it.\n\nWe all come from vastly different backgrounds, and our goals are different, as well as timeframes.\n\nMost will say this \"50-60%\" ROI in 2 years is super easy to get, but I won't.\n\nIt's very hard to go from start to finish and sticking to the plan without something going horribly wrong - for whatever reason, the gambling nature of us here will make us add \"just a few (hundred) thousand more\" or \"this is a great play\" and start chasing loss after loss.\n\nMany accounts on here will never tell you how badly they fumbled things, spiraled out of control, zeroed out, ended up with unpaid tax debt, bankuptcies, and all sorts of things, but they'll always be there to pretend they've nailed both idea and execution - all while whimsically posting about it on X.\n\nIt doesn't work that way - and you shouldn't believe it.\n\nWe often are very keen to put our fate in other people's hands - stocks, devs, teams, KOLs to copytrade, founders, managers, etc.\n\nBut rarely do we ever ask ourselves point blank what it is we really want from ourselves and out of life.\n\nAfter 7 years in crypto, I'm glad to say that I will be coming out of 2025 a changed person, in this one material aspect.\n\nThank you for reading.",
    "summary_chinese": null,
    "summary_english": null,
    "summary_generated_at": null,
    "language": null,
    "title_english": null,
    "tag": "History"
  }
]