[
  {
    "id": "247c1e2d-ba66-481f-8ba6-5dd8a0eb6d78",
    "title": "Pop Mart, Not Poker: Gambling For Women",
    "slug": "popmartnotpokergamblingforwomen--247c1e",
    "author_name": "John Wang",
    "image": "https://pbs.twimg.com/media/GxMlPCuWcAIB8Qk.jpg",
    "author_handle": "j0hnwang",
    "author_avatar": "https://pbs.twimg.com/profile_images/1855724505005727744/2EfWlUVl_normal.jpg",
    "article_published_at": "2025-07-31T15:58:51+00:00",
    "article_url": "https://x.com/j0hnwang/status/1950949285375128036",
    "updated_at": "2025-09-16T09:03:34.486+00:00",
    "category": "",
    "tweet_id": "1950949285375128036",
    "tweet_text": "https://t.co/nyV1YY1dIO",
    "tweet_published_at": "2025-07-31T15:58:51+00:00",
    "tweet_views": 292077,
    "tweet_replies": 89,
    "tweet_retweets": 114,
    "tweet_likes": 1177,
    "tweet_bookmarks": 984,
    "article_preview_text": "The Rise of Softcore Gambling — and Why It’s Dominated by Females\nA girl buys 3 Pop Mart boxes and films a calming TikTok unboxing. She whispers, “Please let me get the sleepy bear variant… but",
    "full_article_content": "The Rise of Softcore Gambling — and Why It’s Dominated by Females\n\nA girl buys 3 Pop Mart boxes and films a calming TikTok unboxing. She whispers, “Please let me get the sleepy bear variant… but honestly I’ll be happy with anything cute.”\n\nA guy rips open a $500 Pokémon booster box on stream, eyes locked on the camera. “If I don’t pull the PSA 10 Charizard, this whole box is fucking worthless,” he mutters.\n\nGambling doesn’t always look like poker chips and slot machines. Sometimes it looks like pink bunnies, blind boxes, and whisper-tone TikToks. Somewhere between retail therapy and roulette, a new habit loop has emerged targeting female consumers. Same random-reward mechanic, but with completely different stakes, vibes, and psychology. Welcome to softcore gambling: a pastel casino built for comfort, not conquest.\n\n1. Yes, the numbers say it’s women\n\nLook at the user mix of the biggest “soft-gambling” brands:\n\nPop Mart blind-box toys: 75% women and 50% repurchase rates (insane!)\n\nShein and Temu: 63 - 66% women compared to Amazon which skews male\n\nSlotomania’s social casino: 72% of active players are women, mainly 35-55 y/os\n\nBy contrast, 2025 World Series of Poker drew only 4% female entrants\n\nThe further you move from money-on-the-table toward surprise-for-its-own-sake, the more female the audience becomes.\n\n2. What \"softcore\" gambling looks like\n\nPop Mart. Twelve cute figurines per series, one or two “secret” variants. Every $10 box is a sure prize, but maybe not your prize. Collectors film whisper-tone unboxings, trade duplicates, and keep coming back—nearly half repurchase within a year, according to the company.\n\nShein & Temu. The toys are tops and lip-gloss; the loot box is a spin-to-win coupon or two-hour lightning deal. Shopping becomes a video game loop like Candy Crush: tap, reveal, dopamine, repeat.\n\nSocial-casino apps (like Slotomania or Bingo Blitz) push the same buttons digitally (free spins, confetti wins, zero real-world risk) yet rake in billions from cosmetic in-app buys.\n\nAll three run on a variable-reward schedule familiar to casino designers, but the stakes are emotional, not financial. Unlike poker or slots, these systems rarely publish odds creating a softer fog-of-war. It’s low-stakes, soft-feedback loop gambling, built for habitual engagement rather than thrill-seeking.\n\n3. Why it works so well\n\nNo total loss. Whether it’s a vinyl bunny or a $2 lipstick, you always get something. That safety net invites play.\n\nRitual over high-risk. Open the box, tap the wheel, post the haul—tiny ceremonies that punctuate a day. A Pop Mart fan might whisper “Please let it be the sleepy bear…” as they unbox under lo-fi music on TikTok. Compare that to GTO expected value calculations and hero calls in poker. The former is self-soothing. The latter is zero-sum conquest.\n\nAesthetic over Conquest: The reward isn’t resale value—it’s how the object fits a vibe, shelf, or mood-board. Pop Mart fans don’t flex prices; they curate scenes with mischievous Labubus beside Sanrio plushes. While male collectors often chase singular power pulls (“I got pocket rockets!”), female collectors tend to seek cohesive sets that reflect personal taste (“I finally got the pink bunny to complete my zodiac series!”).\n\nShared delight, not PvP: Memecoin traders flex 1000% PNL cards. Pokémon unboxers flex $400 pull. Pop Mart unboxers show duplicates on TikTok and ask, “Does anyone want this pink bunny?”. One is one-upmanship. The other is sharing and relatability.\n\nSaving money over making money: Shein shoppers spin wheels for 20% off and invite their friends to unlock coupons. The thrill is in the dopamine of unlocking a deal, not beating the market.\n\n4. Motivations For Gambling\n\nAcademic research backs up this behavioral divergence:\n\nA 2024 study in Addictive Behaviors (Munro et al) found men gamble more for money and competition, while women do it for escape, mood regulation, and social bonding.\n\nAnother study (Li et al) showed women respond more to low-stakes reward loops, while men engage more when the stakes, and potential upside, are higher.\n\nMen gamble for glory; women for joy.\n\n5. The Business Model Of Insane Retention Rates\n\nLow ticket, high volume is the engine. Pop Mart pulls ~60% gross margins; Shein gets users to open the app over 100 times a month. The house doesn’t need whales. It needs hundreds of millions of $10 spins.\n\nLTV isn’t driven by jackpots or leaderboards. It’s built on emotional attachment, soft rituals, and the urge to complete a set. That’s why Pop Mart’s retention outperforms both traditional toy brands and mainstream retail.\n\n6. Shopping is now Gambling\n\nCall it blind-box retail, loot-bag fashion, or pastel slot machines, the mechanic is gambling’s DNA minus the macho bravado.\n\nShein, Temu, and TikTok Shop have taken the same dopamine skeleton and scaled it into full retail ecosystems:\n\nShein: Daily spin wheels, app-only flash bags, recommendation feeds instead of search, 100+ app opens/month\n\nTemu: Lightning deals, social invite-for-coupon roulette, first-day “spin the wheel” mechanics (clicked 1.4× more by women than men)\n\nTikTok Shop: Shoppable unboxing videos labeled “mystery bag” see 2–4× engagement of standard listings. The “surprise premium” is real.\n\nEach platform turns shopping into a gamified loop: check → spin → maybe → repeat. Counterintuitively, the prize isn’t the product. It’s the dopamine hit of opening the box.\n\n7. Conclusion\n\nFor women who rarely see themselves at a poker table, these softer arenas offer the same suspense with none of the stigma.\n\nThe feminine side of gambling isn’t about chasing jackpots. It’s about chasing a feeling: that split-second maybe before the box pops open, the wheel stops spinning, or the flash deal appears. It’s proof that joy can, in fact, be bought for ten dollars at a time.\n\nAnd that makes the “Maybeee Economy” the stickiest casino on earth.",
    "summary_chinese": null,
    "summary_english": null,
    "summary_generated_at": null,
    "language": null,
    "title_english": null,
    "tag": "History"
  }
]